numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
primes = [] # переменная для сбора обьектов списка после проверки условий
not_primes = [] # переменная для сбора обьектов списка после проверки условий
for i in numbers: # запуск цикла присваивающего каждому обьекту списка на кажддой последующей итерации переменную i
    is_prime = True # flag отработает в случае выполнения if из вложеного условия
    if i > 1: # если i больше одного то идем дальше
        for j in range(2 , i  ): # # запуск цикла внутри цикла  присваивающего каждому обьекту списка на кажддой последующей итерации переменную j от двух до значения i
            if i % j  == 0 : # перебор остатков от деления. i делится на все числа от двух до самого i  благодаря функции range
                             # которая создает последовательность чисел внутри определенного диапазона
                is_prime = False # в случае выполнения условия итерация прекращается благодаря смене значения флага
                break # break прерывает текущий цикл и продолжает выполнение следующих выражений
        if is_prime:
            primes.append(i)
        else :
            not_primes.append(i)
print ( primes )
print ( not_primes )
